#2) Выведите количество десятков введенного числа.
print(int(input('n = ?\b'))//10%10)
